# ==== Cтроки (str методы) ====
# .lower()      → маленькие буквы
# .upper()      → большие буквы
# .title()      → Каждое Слово С Заглавной
# .strip()      → убрать пробелы по краям 
# .replace(a,b) → заменить a на b
# .split()      → разделить строку в список
# .join(list)   → объединить список в строку
# .count(x)     → сколько раз встречается x
# .find(x)      → индекс первого вхождения x
# .startswith(x) → начинается ли с x
# .endswith(x)   → заканчивается ли на x
# .isdigit()    → только цифры?
# .isalpha()    → только буквы?


# ===== Списки (list методы) =====
# .append(x)    → добавить элемент
# .extend(list) → добавить несколько
# .insert(i,x)  → вставить по индексу
# .remove(x)    → удалить по значению
# .pop()        → удалить последний
# .clear()      → очистить список
# .index(x)     → индекс элемента
# .count(x)     → сколько раз встречается
# .sort()       → сортировка
# .reverse()    → перевернуть список


# ===== Словари (dict методы) =====
# .keys()     → ключи
# .values()   → значения
# .items()    → пары (ключ, значение)
# .get(key)   → безопасно получить значение
# .pop(key)   → удалить ключ
# .update(d)  → обновить словарь


# ===== Множества (set методы) =====
# .add(x)           → добавить элемент
# .remove(x)        → удалить элемент
# .union(set2)      → объединение
# .intersection()   → пересечение
# .difference()     → разность

nums = [10, 20, 30]
person = {"name": "Anna", "age": 20}

for key in person:
    print(key)

for key, value in person.items():
    print(key, value)
